---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.LogString
source: html/dbfa746b-807f-d58a-cd1c-67ff07f4b968.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.LogString Property

String used for logging, if any. Usually the name of the file from which
 face sets were imported.

## Syntax (C#)
```csharp
public string LogString { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null